{
    "title" : "Rohan Upponi",
    "about": {
        "title" : "A Little Bit More About Me",
        "content" : [
            {
                "description" : "In case that persistent title bar above didn't give it away, I'm Rohan Upponi. I enjoy bolstering my understanding of new technologies through real-world application, as a heavy proponent of learning by doing."
            },
            {
                "description" : "I enjoy building things that both challenge my creativity and offer challenges to overcome in pursuit of making something truly worthwhile whether to me or anyone that comes across it."
            },
            {
                "description" : "When I'm not staring at a computer screen, I enjoy keeping myself going with morning runs and challenging my inner foodie with something new to try!"
            }
        ]
    },
    "experience": {
        "title" : "Where I've Worked",
        "content" : [
            {
                "title" : "Software Development Engineer",
                "externalLink" : "https://campus.capitalone.com/technology-program",
                "logoPath" : "/img/capital-one-logo.png",
                "logoDescriptor" : "Capital One Work Experience",
                "externalLinkText" : "Capital One",
                "timeline" : "(February 2020 - Present)",
                "description" : [
                    {
                        "body" : "Built a Spring Boot microservice supporting Capital One planning and reporting, pushing forward the team’s primary effort to internalize all Salesforce business dependencies within our credit review platform."
                    },
                    {
                        "body" : "Mass-migrated the platform’s secrets and passwords off of enterprise GitHub to internal data lockboxes, closing off a primary vulnerability for internal data breaches."
                    }
                ]
            },
            {
                "title" : "Software Development Intern",
                "externalLink" : "https://stchealth.com/about",
                "logoPath" : "/img/stc-logo.png",
                "logoDescriptor" : "STC Work Experience",
                "externalLinkText" : "Scientific Technologies Corporation",
                "timeline" : "(August 2018 - May 2019)",
                "description" : [
                    {
                        "body" : "Developed API routing backend authentication and account data retrieval services for front-end web app."
                    },
                    {
                        "body" : "Set up CDN delivery of front-end web application hosted on AWS using CloudFront."
                    },
                    {
                        "body" : "Automated AWS infrastructure for immediate deployment and simple scaling of the backend services using CloudFormation, capable of addressing millions of STC's current or potential users."
                    }
                ]
            },
            {
                "title" : "Software Engineering Intern",
                "externalLink" : "https://www.intel.com/content/www/us/en/architecture-and-technology/optane-memory.html",
                "logoPath" : "/img/intel-logo.png",
                "logoDescriptor" : "Intel Work Experience",
                "externalLinkText" : "Intel Corporation",
                "timeline" : "(May 2018 - February 2019)",
                "description" : [
                    {
                        "body" : "Developed an extensive unit-level testing framework that eliminated firmware scaling issues and improved widespread error detection across firmware for Intel Optane memory modules through development of extensive unit-level testing using Unity testing framework."
                    },
                    {
                        "body" : "Wrote hardware optimizations through close communication with hardware team on detailed hardware specifications."
                    }
                ]
            },
            {
                "title" : "Software Development Extern",
                "externalLink" : "https://www.azcourts.gov/AZSupremeCourt",
                "logoPath" : "/img/az-supreme-court-logo.png",
                "logoDescriptor" : "Arizona Supreme Court Work Experience",
                "externalLinkText" : "Arizona Supreme Court",
                "timeline" : "(June 2017 - August 2017)",
                "description" : [
                    {
                        "body" : "Created a GUI viewing tool for querying a SQL database of court cases, streamlining front-end interaction with digital database and formatting cases to different templates based on case type."
                    },
                    {
                        "body" : "Created and implemented test scripts to debug the Supreme Court Case Management System, providing patches and confirming system integrity for the v 47.0 system update."
                    }
                ]
            },
            {
                "title" : "Undergraduate Teaching Assistant",
                "externalLink" : "https://cidse.engineering.asu.edu/teaching-research-assistantships-fellowships-awards/",
                "logoPath" : "/img/asu-logo.png",
                "logoDescriptor" : "Arizona State University Work Experience",
                "externalLinkText" : "Arizona State University",
                "timeline" : "(January 2017 - May 2017)",
                "description" : [
                    {
                        "body" : "Improved student grades by an average of one letter grade relative to standard average through hosting crash-course review sessions for students outside lecture to aid in developing more intuitive understanding of object-oriented programming with Java."
                    },
                    {
                        "body" : "Engaged student day-to-day comprehension through administering and guiding students on planned weekly in-class coding exercises."
                    }
                ]
            }
        ]
    },
    "work" : {
        "title" : "My Work",
        "content" : [
            {
                "title" : "Scriber",
                "externalLink" : "https://github.com/rupponi/scriber",
                "description" : "An Android app focusing on giving users the ability to create their own medical portfolios. Keep notes from different doctor's visits. Hold onto easily forgotten information such as family illness history, lifestyle changes, past vaccination dates, etc.",
                "skills" : ["Android", "Java", "XML", "Google Firestore"]
            },
            {
                "title" : "Viz for Spotify",
                "externalLink" : "https://github.com/rupponi/ticketify",
                "description" : "A web app utilizing Spotify Web APIs, originally for ticketing but looking at music visualization.",
                "skills" : ["ReactJS", "Node.js", "Express.js", "HTML", "CSS"]
            },
            {
                "title" : "WavPlayer",
                "externalLink": "https://github.com/rupponi/wavplayer",
                "description" : "My first significant personal project working with Java multithreading and UI/UX components with the JavaFX media library. WavPlayer plays MP3's and WAV files, running in a Java 8 environment and capable of running on Windows and Linux.",
                "skills" : ["Java", "JavaFX GUI", "Javax Media", "Multithreading"]
            },
            {
                "title" : "Personal Website (v.7)",
                "externalLink" : "https://github.com/rupponi/portfolio",
                "description" : "My current personal website that acts as a porfolio for my skills and projects, while also providing a valuable foundation for web development.",
                "skills" : ["Gatsby.js", "HTML", "CSS", "Netlify"]
            }
        ]
    }
}